# Pandas（建於numpy之上）

In [1]:
import pandas as pd

## Build Dataframe

In [2]:
# by column

df = pd.DataFrame({'Name':['Amy', 'Ben', 'Albert'], 'Score':[90, 50, 100]})
df

     Name  Score
0     Amy     90
1     Ben     50
2  Albert    100

In [3]:
# by row

df1 = pd.DataFrame([{'Name':'Mark', 'Score':88}, {'Name':'Jason', 'Score':34}, {'Name':'Wix', 'Score':99}])
df1

    Name  Score
0   Mark     88
1  Jason     34
2    Wix     99

In [4]:
# build from list

a = ['Amy', 'Ben', 'Larry']
b = [56, 78, 90]

merge = list(zip(a, b))
print(merge)

df_list = pd.DataFrame(merge, columns=['Name', 'Score'])
df_list

[('Amy', 56), ('Ben', 78), ('Larry', 90)]

    Name  Score
0    Amy     56
1    Ben     78
2  Larry     90

## 讀取檔案（read_csv）

- 無 column name

In [5]:
# names

test = pd.read_csv('/Users/shanghungshih/Desktop/AIA/Python/data/birth_data_noColumnName.csv')
print(test)

test = pd.read_csv('/Users/shanghungshih/Desktop/AIA/Python/data/birth_data_noColumnName.csv', names=['births', 'Names'])
test

   0  968      Bob
0  1  155  Jessica
1  2   77     Mary
2  3  578     John
3  4  973      Mel

   births    Names
0     968      Bob
1     155  Jessica
2      77     Mary
3     578     John
4     973      Mel

- 自訂 index

In [6]:
# index_col

test = pd.read_csv('/Users/shanghungshih/Desktop/AIA/Python/data/birth_data_wrongIndex.csv')
print(test)

test = pd.read_csv('/Users/shanghungshih/Desktop/AIA/Python/data/birth_data_wrongIndex.csv', index_col=2)
print(test)

test = pd.read_csv('/Users/shanghungshih/Desktop/AIA/Python/data/birth_data_wrongIndex.csv', index_col=0)
test

   Unnamed: 0  births    names
0           0     968      Bob
1           1     155  Jessica
2           2      77     Mary
3           3     578     John
4           4     973      Mel
         Unnamed: 0  births
names
Bob               0     968
Jessica           1     155
Mary              2      77
John              3     578
Mel               4     973

   births    names
0     968      Bob
1     155  Jessica
2      77     Mary
3     578     John
4     973      Mel

## 寫出檔案

In [7]:
# index = False

test.to_csv('/Users/shanghungshih/Desktop/AIA/Python/data/out_test_False.csv', index=False)
test = pd.read_csv('/Users/shanghungshih/Desktop/AIA/Python/data/out_test_False.csv')
test.head()

   births    names
0     968      Bob
1     155  Jessica
2      77     Mary
3     578     John
4     973      Mel

In [8]:
# index = True

test.to_csv('/Users/shanghungshih/Desktop/AIA/Python/data/out_test_True.csv', index=True)
test = pd.read_csv('/Users/shanghungshih/Desktop/AIA/Python/data/out_test_True.csv')
test.head()

   Unnamed: 0  births    names
0           0     968      Bob
1           1     155  Jessica
2           2      77     Mary
3           3     578     John
4           4     973      Mel

## Get column

In [9]:
# 取 Series

df['Name']   # 或 df.Name

0       Amy
1       Ben
2    Albert
Name: Name, dtype: object

In [10]:
# 取 Dataframe

df[['Name', 'Score']]

     Name  Score
0     Amy     90
1     Ben     50
2  Albert    100

## Get row

In [11]:
df[:-1]

  Name  Score
0  Amy     90
1  Ben     50

In [12]:
# 隨機 sample

df.sample(2)

     Name  Score
2  Albert    100
1     Ben     50

## Get values
- loc [ index , column name ]
- iloc [ row , column ]

In [13]:
df['Score'].values

array([ 90,  50, 100])

In [14]:
df.loc[:,'Score']

0     90
1     50
2    100
Name: Score, dtype: int64

## 條件篩選
- |（or）
- &（and）

In [15]:
df[(df['Score']<60) | (df['Score']>95)]

     Name  Score
1     Ben     50
2  Albert    100

## Add new value

In [16]:
# by column

df['Time']=[40, 85, 30]
df

     Name  Score  Time
0     Amy     90    40
1     Ben     50    85
2  Albert    100    30

In [17]:
# by row

df = df.append(pd.DataFrame([{'Name':'Rober', 'Score':87, 'Time':45}])).reset_index(drop=True)
df

     Name  Score  Time
0     Amy     90    40
1     Ben     50    85
2  Albert    100    30
3   Rober     87    45

## 合併 two dataframe

In [18]:
# columns名稱相同

df2 = pd.concat([df, df1]).reset_index(drop=True)
df2

     Name  Score  Time
0     Amy     90  40.0
1     Ben     50  85.0
2  Albert    100  30.0
3   Rober     87  45.0
4    Mark     88   NaN
5   Jason     34   NaN
6     Wix     99   NaN

In [19]:
# columns名稱不同（須先使columns名稱相同）

df3 = pd.DataFrame([{'age':23, 'color':'white'}, {'age':33, 'color':'yellow'}])
df4 = pd.DataFrame([{38:45, 'red':'black'}, {38:67, 'red':'green'}])

tmp = pd.DataFrame(df4.columns).transpose()    
df4.columns = df3.columns
tmp.columns = df3.columns
df5 = pd.concat([df3, tmp, df4]).reset_index(drop=True)
df5

  age   color
0  23   white
1  33  yellow
2  38     red
3  45   black
4  67   green

In [20]:
# merge

df5 = pd.DataFrame(list(zip(['Ben', 'Albert', 'Jason', 'Wax', 'Mark', 'Amy'], [1, 0, 1, 1, 1, 0])), columns=['Name', 'status'])
pd.merge(df2, df5, on=['Name'], how='left')

     Name  Score  Time  status
0     Amy     90  40.0     0.0
1     Ben     50  85.0     1.0
2  Albert    100  30.0     0.0
3   Rober     87  45.0     NaN
4    Mark     88   NaN     1.0
5   Jason     34   NaN     1.0
6     Wix     99   NaN     NaN

## 更改 dataframe 值
- column name
- row name
- column value
- row value
- 特定row, column值

In [21]:
# column name 方法一

df.columns = ['Name', 'Score', 'Confidence']
df

     Name  Score  Confidence
0     Amy     90          40
1     Ben     50          85
2  Albert    100          30
3   Rober     87          45

In [22]:
# column name 方法二

df = df.rename(columns={'Confidence':'Time'}).reset_index(drop=True)
df

     Name  Score  Time
0     Amy     90    40
1     Ben     50    85
2  Albert    100    30
3   Rober     87    45

In [23]:
# row name

df.index = ['Amy', 'Ben', 'Albert', 'Rober']
df

          Name  Score  Time
Amy        Amy     90    40
Ben        Ben     50    85
Albert  Albert    100    30
Rober    Rober     87    45

In [24]:
# column value

df2.loc[:,'Time'] = [20, 85, 60, 45, 30, 35, 21]
df2

     Name  Score  Time
0     Amy     90    20
1     Ben     50    85
2  Albert    100    60
3   Rober     87    45
4    Mark     88    30
5   Jason     34    35
6     Wix     99    21

In [25]:
# row value

df2.loc[6,:] = ['Wax', 98, 23]
df2

     Name  Score  Time
0     Amy     90    20
1     Ben     50    85
2  Albert    100    60
3   Rober     87    45
4    Mark     88    30
5   Jason     34    35
6     Wax     98    23

## 刪除 row, column
- axis：0（row）, 1（column）

In [26]:
# 刪除 column

df2 = df2.drop(['Time'], axis=1)
df2

     Name  Score
0     Amy     90
1     Ben     50
2  Albert    100
3   Rober     87
4    Mark     88
5   Jason     34
6     Wax     98

In [27]:
# 刪除 row

df2 = df2.drop(3, axis=0).reset_index(drop=True)
df2

     Name  Score
0     Amy     90
1     Ben     50
2  Albert    100
3    Mark     88
4   Jason     34
5     Wax     98

## 設定

In [28]:
# 顯示欄位最多到50（不會有 ... ）

pd.set_option('display.max_columns', 50)

## 範例

In [29]:
import pandas as pd
import numpy as np

np.random.seed(111)

def CreateDataSet(Number=1):
    Output = []
    for i in range(Number):
        rng = pd.date_range('1/1/2009', '12/31/2012', freq='W-TUE')
        
        data = np.random.randint(25, 1000, len(rng))
        
        status = [1,2,3]
        
        random_status = [status[np.random.randint(0, len(status))] for i in range(len(rng))]
        
        states = ['GA','FL','fl','NY','NJ','TX']
        
        random_states = [states[np.random.randint(0, len(states))] for i in range(len(rng))]
    
        Output.extend(zip(random_states, random_status, data, rng))
        
    return Output

In [30]:
dataset = CreateDataSet(4)
df = pd.DataFrame(data=dataset, columns=['State','Status','CustomerCount','StatusDate'])
df.head(10)

  State  Status  CustomerCount StatusDate
0    GA       1            877 2009-01-06
1    FL       1            901 2009-01-13
2    fl       3            749 2009-01-20
3    FL       3            111 2009-01-27
4    GA       1            300 2009-02-03
5    FL       2            706 2009-02-10
6    TX       3            347 2009-02-17
7    fl       2            143 2009-02-24
8    FL       3            833 2009-03-03
9    NY       1            992 2009-03-10

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 832 entries, 0 to 831
Data columns (total 4 columns):
State            832 non-null object
Status           832 non-null int64
CustomerCount    832 non-null int64
StatusDate       832 non-null datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 26.1+ KB

In [32]:
df.apply(len, axis=0)

State            832
Status           832
CustomerCount    832
StatusDate       832
dtype: int64

In [33]:
df.apply(len, axis=1)

0      4
1      4
2      4
3      4
4      4
5      4
6      4
7      4
8      4
9      4
10     4
11     4
12     4
13     4
14     4
15     4
16     4
17     4
18     4
19     4
20     4
21     4
22     4
23     4
24     4
25     4
26     4
27     4
28     4
29     4
      ..
802    4
803    4
804    4
805    4
806    4
807    4
808    4
809    4
810    4
811    4
812    4
813    4
814    4
815    4
816    4
817    4
818    4
819    4
820    4
821    4
822    4
823    4
824    4
825    4
826    4
827    4
828    4
829    4
830    4
831    4
Length: 832, dtype: int64

In [34]:
# Series 運算

print(type(df.Status))
df.Status = df.Status + 1

# ndarray 運算

print(type(df.Status.values))
df.Status = df.Status.values - 1
df.Status.head()

<class 'pandas.core.series.Series'>
<class 'numpy.ndarray'>

0    1
1    1
2    3
3    3
4    1
Name: Status, dtype: int64

In [35]:
g_state = df.groupby(['State'])
print(g_state.size())
print(g_state.sum())
print(g_state.groups)
print(g_state.get_group('FL'))

State
FL    144
GA    143
NJ    138
NY    123
TX    136
fl    148
dtype: int64
       Status  CustomerCount
State
FL        289          74575
GA        297          73531
NJ        283          75357
NY        243          65661
TX        271          59755
fl        292          73880
{'FL': Int64Index([  1,   3,   5,   8,  22,  28,  35,  42,  43,  49,
            ...
            782, 784, 786, 787, 806, 807, 811, 816, 817, 823],
           dtype='int64', length=144), 'GA': Int64Index([  0,   4,  12,  17,  21,  24,  25,  31,  48,  57,
            ...
            747, 752, 753, 756, 759, 767, 769, 790, 792, 831],
           dtype='int64', length=143), 'NJ': Int64Index([ 15,  16,  23,  29,  36,  38,  45,  46,  50,  53,
            ...
            793, 794, 795, 797, 798, 803, 815, 820, 825, 830],
           dtype='int64', length=138), 'NY': Int64Index([  9,  19,  40,  55,  56,  70,  72,  74,  81,  91,
            ...
            712, 726, 736, 765, 780, 781, 799, 808, 810, 822],
           dtype='int64', length=123), 'TX': Int64Index([  6,  11,  20,  30,  32,  41,  44,  58,  65,  73,
            ...
            771, 778, 801, 802, 804, 805, 809, 819, 821, 826],
           dtype='int64', length=136), 'fl': Int64Index([  2,   7,  10,  13,  14,  18,  26,  27,  33,  34,
            ...
            796, 800, 812, 813, 814, 818, 824, 827, 828, 829],
           dtype='int64', length=148)}
     CustomerCount  Status StatusDate
1              901       1 2009-01-13
3              111       3 2009-01-27
5              706       2 2009-02-10
8              833       3 2009-03-03
22             737       2 2009-06-09
28             710       1 2009-07-21
35             587       3 2009-09-08
42             930       3 2009-10-27
43             195       3 2009-11-03
49             510       3 2009-12-15
52              99       1 2010-01-05
60             871       1 2010-03-02
61             757       2 2010-03-09
69             225       2 2010-05-04
89             642       2 2010-09-21
95             451       1 2010-11-02
96              75       1 2010-11-09
97             116       2 2010-11-16
100            705       2 2010-12-07
108            959       2 2011-02-01
112            882       2 2011-03-01
127            798       2 2011-06-14
143            491       1 2011-10-04
150            847       3 2011-11-22
159             85       2 2012-01-24
160            883       3 2012-01-31
163            784       2 2012-02-21
165            888       1 2012-03-06
166            109       3 2012-03-13
170            318       1 2012-04-10
..             ...     ...        ...
693            199       2 2010-05-04
706            602       2 2010-08-03
708            678       1 2010-08-17
710            676       3 2010-08-31
724            800       1 2010-12-07
729            336       2 2011-01-11
730             81       1 2011-01-18
732             51       3 2011-02-01
733            950       2 2011-02-08
735             51       3 2011-02-22
745            880       1 2011-05-03
746            333       2 2011-05-10
751            398       1 2011-06-14
761            125       1 2011-08-23
764            306       2 2011-09-13
770            865       2 2011-10-25
775            742       3 2011-11-29
776            348       3 2011-12-06
777            214       2 2011-12-13
779            667       3 2011-12-27
782            141       1 2012-01-17
784            606       2 2012-01-31
786            279       3 2012-02-14
787            225       1 2012-02-21
806            670       3 2012-07-03
807            500       3 2012-07-10
811            100       1 2012-08-07
816            210       3 2012-09-11
817            363       3 2012-09-18
823             46       3 2012-10-30

[144 rows x 3 columns]

In [36]:
g_state2 = df.groupby(['StatusDate', 'State'], sort=True).sum()
g_state2

                  Status  CustomerCount
StatusDate State
2009-01-06 GA          1            877
           TX          5            691
           fl          1            239
2009-01-13 FL          1            901
           NJ          1            724
           NY          2            122
           TX          2            529
2009-01-20 FL          1            530
           NY          3            955
           fl          4            993
2009-01-27 FL          6            633
           GA          2            500
           NY          2            447
2009-02-03 FL          3            681
           GA          1            300
           fl          4            783
2009-02-10 FL          2            706
           TX          2            733
           fl          5           1036
2009-02-17 FL          5            908
           NY          2            263
           TX          3            347
2009-02-24 FL          2            514
           GA          3            771
           fl          5            601
2009-03-03 FL          3            833
           NY          3            882
           TX          5           1433
2009-03-10 FL          3            682
           NJ          2            653
...                  ...            ...
2012-10-23 NJ          1            203
           NY          4            603
2012-10-30 FL          3             46
           NJ          6            940
           TX          3            544
2012-11-06 FL          3            183
           GA          3            564
           NJ          2            895
           fl          2            920
2012-11-13 FL          1            569
           NJ          5           1498
           fl          1            129
2012-11-20 NJ          3            573
           TX          9           2557
2012-11-27 NJ          1            748
           NY          2            980
           TX          1            136
           fl          1            924
2012-12-04 FL          4           1195
           fl          5            849
2012-12-11 FL          2            355
           NJ          1            500
           TX          2            162
           fl          1            428
2012-12-18 GA          3            809
           NJ          4           1550
           NY          1            201
2012-12-25 FL          2            969
           GA          4            462
           NJ          3            962

[650 rows x 2 columns]